In [1]:
import pandas as pd
import numpy as np

Working with series in pandas

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = dict(zip(labels, my_data))

creating a pandas series

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

Utilizing series Index

In [7]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'GERMANY', 'USSR', 'JAPAN'])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [8]:
ser2 = pd.Series(data=[1, 2, 5, 4], index=['USA', 'GERMANY', 'ITALY', 'JAPAN'])
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [9]:
ser1['USA']

1

In [10]:
ser2['ITALY']

5

In [11]:
ser1 + ser2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

Working with Pandas Dataframes

In [12]:
from numpy.random import randn

In [13]:
np.random.seed(seed=101)

In [14]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Indexing in pandas dataframes

In [15]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

Creating new columns in a Df

In [18]:
df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Removing a column Dataframes

In [19]:
df.drop('X',axis=1,inplace=True)
df

          W         Y         Z       NEW
A  2.706850  0.907969  0.503826  3.614819
B  0.651118 -0.848077  0.605965 -0.196959
C -2.018168  0.528813 -0.589001 -1.489355
D  0.188695 -0.933237  0.955057 -0.744542
E  0.190794  2.605967  0.683509  2.796762

Removing rows from a Dataframe

In [20]:
df.drop('E', inplace=True)
df

          W         Y         Z       NEW
A  2.706850  0.907969  0.503826  3.614819
B  0.651118 -0.848077  0.605965 -0.196959
C -2.018168  0.528813 -0.589001 -1.489355
D  0.188695 -0.933237  0.955057 -0.744542

In [21]:
df.shape

(4, 4)

In [22]:
df.rename(columns={'W': 'Column1', 'Y': 'Column2'},inplace=True)
df

    Column1   Column2         Z       NEW
A  2.706850  0.907969  0.503826  3.614819
B  0.651118 -0.848077  0.605965 -0.196959
C -2.018168  0.528813 -0.589001 -1.489355
D  0.188695 -0.933237  0.955057 -0.744542

In [23]:
df[['column3','column4']] = [0, 1]
df

    Column1   Column2         Z       NEW  column3  column4
A  2.706850  0.907969  0.503826  3.614819        0        1
B  0.651118 -0.848077  0.605965 -0.196959        0        1
C -2.018168  0.528813 -0.589001 -1.489355        0        1
D  0.188695 -0.933237  0.955057 -0.744542        0        1

Etracting rows from Dataframe

In [24]:
df.loc['C']

Column1   -2.018168
Column2    0.528813
Z         -0.589001
NEW       -1.489355
column3    0.000000
column4    1.000000
Name: C, dtype: float64

In [25]:
df.iloc[2]

Column1   -2.018168
Column2    0.528813
Z         -0.589001
NEW       -1.489355
column3    0.000000
column4    1.000000
Name: C, dtype: float64

Selecting subsets of a Dataframe

In [26]:
df.loc['C', 'Column2']

0.5288134940893595

In [27]:
df.loc[['A','B'], ['Column1', 'Column2']]

    Column1   Column2
A  2.706850  0.907969
B  0.651118 -0.848077

Using conditional operators with Dataframes

In [28]:
df[df>0]

    Column1   Column2         Z       NEW  column3  column4
A  2.706850  0.907969  0.503826  3.614819      NaN        1
B  0.651118       NaN  0.605965       NaN      NaN        1
C       NaN  0.528813       NaN       NaN      NaN        1
D  0.188695       NaN  0.955057       NaN      NaN        1

In [29]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df[(df['W']>0) & (df['Y']>0.1)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

resetting index in dataframes

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

creating new index

In [32]:
newind = 'CA NY WR OR CO'.split()
newind

['CA', 'NY', 'WR', 'OR', 'CO']

In [33]:
df['states']=newind

In [34]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WR
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [35]:
df.set_index('states')

               W         X         Y         Z
states
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WR      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

Multi-heirachy index in Dataframes

In [36]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [37]:
inside = '1 2 3 1 2 3'.split()
inside

['1', '2', '3', '1', '2', '3']

In [38]:
heir_index = list(zip(outside, inside))
heir_index

[('G1', '1'), ('G1', '2'), ('G1', '3'), ('G2', '1'), ('G2', '2'), ('G2', '3')]

In [39]:
heir_index = pd.MultiIndex.from_tuples(heir_index)
heir_index

MultiIndex([('G1', '1'),
            ('G1', '2'),
            ('G1', '3'),
            ('G2', '1'),
            ('G2', '2'),
            ('G2', '3')],
           )

In [40]:
df = pd.DataFrame(randn(6,2), heir_index, ['A', 'B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [41]:
df.index.names = ['Groups', 'Numbers']
df

                       A         B
Groups Numbers
G1     1       -0.993263  0.196800
       2       -1.136645  0.000366
       3        1.025984 -0.156598
G2     1       -0.031579  0.649826
       2        2.154846 -0.610259
       3       -0.755325 -0.346419

In [42]:
df.xs('G1')

                A         B
Numbers
1       -0.993263  0.196800
2       -1.136645  0.000366
3        1.025984 -0.156598

Handling missing data

In [43]:
labels = ['A', 'B', 'C']
data = [[1, 2, np.nan],[5, np.nan, np.nan],[1, 2, 3]]
d = dict(zip(labels, data))
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [44]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [46]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

df.dropna(thresh=2)

In [47]:
df.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [48]:
df['A'].fillna(value=(df['A'].mean()))

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

The Groupby function

In [49]:
cols = ['Company', 'Names', 'Sales']
data = [['GOOG', 'GOOG', 'MSFT', 'MSFT','FB','FB'], ['SAM','CHARLIE','AMY','VENESSA','CARL','SARAH'],[200,120,340,124,243,350]]
diction = dict(zip(cols,data))
df=pd.DataFrame(diction)
df

  Company    Names  Sales
0    GOOG      SAM    200
1    GOOG  CHARLIE    120
2    MSFT      AMY    340
3    MSFT  VENESSA    124
4      FB     CARL    243
5      FB    SARAH    350

In [50]:
df.groupby(by='Company').sum()

              Names  Sales
Company
FB        CARLSARAH    593
GOOG     SAMCHARLIE    320
MSFT     AMYVENESSA    464

In [51]:
df.groupby(by='Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

Dataframe concatination

In [52]:
df1 = pd.DataFrame({'A':[1, 2, 3, 4], 'B':[5, 6, 7, 8], 'C':[9, 10 , 11, 12]}, index = ['a', 'b', 'c', 'd'])
df1

   A  B   C
a  1  5   9
b  2  6  10
c  3  7  11
d  4  8  12

In [53]:
df2 = pd.DataFrame({'A':[13,14,15,16], 'B':[17,18,19,20], 'C':[21,22,23,24]}, index = ['e', 'f', 'g', 'h'])
df2

    A   B   C
e  13  17  21
f  14  18  22
g  15  19  23
h  16  20  24

In [54]:
df3 = pd.concat([df1, df2])
df3

    A   B   C
a   1   5   9
b   2   6  10
c   3   7  11
d   4   8  12
e  13  17  21
f  14  18  22
g  15  19  23
h  16  20  24

Data input and Output

In [55]:
conda install sqlalchemy

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 23.7.4
  latest version: 23.11.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.11.0

In [56]:
conda install lxml

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 23.7.4
  latest version: 23.11.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.11.0

In [57]:
conda install html5lib

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 23.7.4
  latest version: 23.11.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.11.0

In [58]:
conda install BeautifulSoup4

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 23.7.4
  latest version: 23.11.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.11.0

In [66]:
df = pd.read_excel('Excel_Sample.xlsx')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [67]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [74]:
data[0].groupby('CityCity').sum()

,Bank NameBank,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
CityCity,,,,,,
Acworth,Northwest Bank & Trust,GA,57658,State Bank and Trust Company,"July 30, 2010",10274
Ailey,Montgomery Bank & Trust,GA,19498,Ameris Bank,"July 6, 2012",10448
Alamo,Bank of Alamo,TN,9961,No Acquirer,"November 8, 2002",4658
Albuquerque,High Desert State Bank,NM,35279,First American Bank,"June 25, 2010",10252
Aledo,Country Bank,IL,35395,Blackhawk Bank & Trust,"October 14, 2011",10402
...,...,...,...,...,...,...
Woodbury,The Woodbury Banking CompanyBrickwell Communit...,GAMN,69033,United BankCorTrust Bank N.A.,"August 19, 2016September 11, 2009",20639
Woodland Hills,Western Commercial Bank,CA,58087,First California Bank,"November 5, 2010",10310
Woodstock,First Cherokee State BankCreekSide BankSecurit...,GAGAGA,148042,Community & Southern BankGeorgia Commerce Bank...,"July 20, 2012September 2, 2011July 24, 2009",30933
Worth,Founders Bank,IL,18390,The PrivateBank and Trust Company,"July 2, 2009",10074
Wyoming,The RiverBank,MN,10216,Central Bank,"October 7, 2011",10399